# FamilySizeTableErrorInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo Constructor
FamilySizeTableErrorInfo Class See Also
---
Constructs a new FamilySizeTableErrorInfo with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FamilySizeTableErrorInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FamilySizeTableErrorInfo()
```

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace